job/backend/controllers/ManagerController.php

SELECT `id` FROM `job_admin_user` WHERE u_name='bbbb'
---
    public function actionManagerAdd(){
        $request=\yii::$app->request;
        $con=\yii::$app->db;
        if($request->isPost){
            $data=$request->post();

            //验证非空
            if(!$data['u_name']){
                echo "<script>alert('管理员名称不能为空！');location.href='?r=manager/manager-add'</script>";die;
            }else{
                $query=new \yii\db\Query();
                $res=$query->select('id')->from('job_admin_user')->where("u_name=:u_name",[':u_name'=>$data['u_name']])->one();

INSERT INTO `job_admin_user` (`u_name`, `u_pwd`) VALUES ('bbbb', 'e10adc3949ba59abbe56e057f20f883e')
---
            }

            $u_pwd=md5($data['u_pwd']);
            $res=$con->createCommand()->insert('job_admin_user',['u_name'=>$data['u_name'],'u_pwd'=>$u_pwd])->execute();

SELECT * FROM `job_admin_role`
---
            //print_r($data);
        }else{
            $query=new \yii\db\Query();
            $privilege=$query->select('*')->from('job_admin_role')->all();

SELECT `r_name` FROM `job_admin_role` `ar` LEFT JOIN `job_user_role` `ur` ON ar.id=ur.rid LEFT JOIN `job_user_role` `ur` ON ar.id=ur.rid WHERE ur.uid=18
---
    public function actionManagerList(){

        $request = \yii::$app->request;
        $query=new \yii\db\Query();
        $con=\yii::$app->db;
        $user = new \backend\models\JobAdminUser;
        $page=$request->get('page') ? $request->get('page') : 1;
        $count=$user->getCount();
        $length=5;
        $limit=($page-1)*$length;

        $sql="select * from `job_admin_user` limit $limit,$length";
        $info=$con->createCommand($sql)->queryAll();

        foreach($info as $k=>$v){
            /*$roleInfo=$query->select('r_name')
            ->from('job_user_role ur')
            ->leftJoin('job_admin_role ar','ar.id=ur.rid')
            ->where('ur.uid='.$v['id'])
            ->all();*/