job/backend/controllers/ManagerController.php

DELETE FROM `job_admin_user` WHERE `id`='9'
---
    public function actionDel(){
        $request=\yii::$app->request;
        $con=\yii::$app->db;
        $id=$request->get('id');
        $res=$con->createCommand()->delete('job_admin_user',['id'=>$id])->execute();

SELECT `id`, `u_name` FROM `job_admin_user` WHERE id=11
---
    public function actionUpdate(){
        $request=\yii::$app->request;
        $con=\yii::$app->db;
        $query=new \yii\db\Query();
        if($request->isPost){
            $data=$request->post();

            //验证密码与确认密码是否相符
            if($data['u_pwd']!=$data['q_pwd']){

                echo "<script>alert('密码与确认密码不符！');location.href='?r=manager/manager-add'</script>";die;
            }

            //print_r($data);
            $res=$con->createCommand()->update('job_admin_user',['u_name'=>$data['u_name'],'u_pwd'=>$data['u_pwd']],['id'=>$data['u_id']])->execute();
            if($res){
                echo "<script>alert('修改成功');location.href='?r=manager/manager-list'</script>";
            }else{
                echo "<script>alert('修改失败');location.href='?r=manager/manager-edit'</script>";
            }
        }else{
            $id=$request->get('id');
            $info=$query->select(['id','u_name'])->from('job_admin_user')->where('id='.$id)->one();