lagou/job/frontend/models/JobCompany.php

SELECT * FROM `job_company`
---
    public function getAll()
    {
        return $this->find()->asArray()->all();