job/backend/models/JobAdminUser.php

    public function getCount()
    {
        return $this->find()->count();
---
SELECT COUNT(*) FROM `job_admin_user`