job/backend/models/JobPosition.php

SELECT * FROM `job_position`
---
    public function getAll()
    {
        return $this->find()->asArray()->all();

SELECT COUNT(*) FROM `job_position`
---
    public function getCount()
    {
        return $this->find()->count();