lagou/job/backend/controllers/PositionController.php

SELECT * FROM `job_position`
---
    public function actionAdd(){
      $request=\Yii::$app->request;
      if($request->isPost)
      {
        $model=$request->post();
        unset($model['_csrf']);
            $connection= \Yii::$app->db;
             $res=$connection->createCommand()->insert('job_position',[
                    'position_name'=>$model['position_name'],
                    'parent_id'=>$model['parent_id'],
                    'is_hot'=>$model['is_hot'],
                    'is_new'=>$model['is_new'],
                    'is_show'=>$model['is_show'],
                ])->execute();
             if($res)
             {
                echo "<script>alert('添加成功');location.href='?r=position/list'</script>";
             }
             else
             {
                echo "<script>alert('添加失败');location.href='?r=position/add'</script>";
             }
      }
      else
      {
        $res=JobPosition::find()->asArray()->all();

SELECT * FROM `job_position` WHERE `id`='1'
SELECT * FROM `job_position` WHERE id!=1
---
    public function actionUpdate(){
        $request= \Yii::$app->request;
        $id = empty($request->get('id','')) ? $request->post('id','') : $request->get('id','');
        if($request->isPost){
          $post=$request->post();
          unset($post['_csrf']);
          if(JobPosition::updateAll($post,['id'=>$id])){
            echo "<script>alert('修改成功');location.href='?r=position/list'</script>";
          }
          else
          {
            echo "<script>alert('修改失败');location.href='?r=position/upda'</script>";
          }
        }
        else
        {
          $re=JobPosition::find()->where(['id'=>$id])->asArray()->one();
          $res=JobPosition::find()->where("id!=$id")->asArray()->all();