lagou/job/backend/controllers/RbacController.php

SELECT * FROM `job_admin_role`
---
    public function actionUsershow()
    {

		$roleList = JobAdminRole::find()->asArray()->all();	//获取角色数据