lagou/job/frontend/controllers/Usually.php

	public function Positionarray()
	{
		//传值到首页的职位数组
		$list = array();
		$res = $this->db->select('*')->from('job_position')->all();
---
SELECT * FROM `job_position`