lagou/job/backend/models/JobAdminPrivilege.php

    public function getAll()
    {
        return $this->find()->asArray()->all();
---
SELECT * FROM `job_admin_privilege`