lagou/job/backend/models/JobAdminRole.php

SELECT * FROM `job_admin_role`
---
    public function getAll()
    {
        return $this->find()->asArray()->all();