lagou/job/backend/models/JobPosition.php

    public function getwhere($id)
    {
        return $this->find()->where(['parent_id'=>$id])->asArray()->all();
---
SELECT * FROM `job_position` WHERE `parent_id`='13'

    public function getAll()
    {
        return $this->find()->asArray()->all();
---
SELECT * FROM `job_position`

    public function deldate($id){
        $result=$this->find()->where(['id'=>$id])->one();
       return $result->delete();
---
SELECT * FROM `job_position` WHERE `id`='13'
DELETE FROM `job_position` WHERE `id`='13'

    public function getCount()
    {
        return $this->find()->count();
---
SELECT COUNT(*) FROM `job_position`