job/frontend/controllers/IndexController.php

SELECT * FROM `job_region` WHERE `agency_id`=1
UPDATE `job_position` SET `hot_num`=7 WHERE `id`='36'
---
	public function actionSelpos()
	{
		//职位搜索信息
		$posname = $this->request->get('kd');
		if(!isset($posname))
		{
			$posname = $this->request->post('kd');
		}
		//网站根目录
      	$job = \Yii::$app->basePath.'/../';
		$pos_str = file_get_contents($job.'/common/config/position.php');
		$pos_array = explode(',',$pos_str);
		//城市
		$data['city'] = JobRegion::find()->where(['agency_id' => 1])->asArray()->all();
		if(in_array($posname,$pos_array))
		{
			//热词字段+1
			$hot_sou = JobPosition::find()->where(['position_name' => $posname])->asArray()->one();
			$res['hot_num'] = $hot_sou['hot_num']+1;
			JobPosition::updateAll($res,['id'=>$hot_sou['id']]);