job/frontend/controllers/PersonalController.php

SELECT * FROM `job_ess_info` WHERE `uid`='44'
---
	public function init()
	{
		$this->session   = \Yii::$app->session;       //调用session组件
        $this->session->open();					       //开启session
		$uid=$this->session->get('userid');
        $res=JobEssInfo::find()->where(['uid'=>$uid])->asArray()->one();